app/controllers/articles_controller.rb

    def index
        @articles = Article.all
---
SELECT "articles".* FROM "articles"

    def show
        @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]